In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

传入how='all'将只丢弃全为NA的那些行：

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.141879       NaN       NaN
1 -0.434911       NaN       NaN
2 -0.245262       NaN  0.887664
3 -0.163723       NaN  1.476460
4  1.705341 -1.737614 -0.114075
5 -0.444799 -0.019655 -0.514444
6 -0.304669 -1.897173  0.963890

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.245262       NaN  0.887664
3 -0.163723       NaN  1.476460
4  1.705341 -1.737614 -0.114075
5 -0.444799 -0.019655 -0.514444
6 -0.304669 -1.897173  0.963890

In [23]:
df.fillna(0)

          0         1         2
0 -0.141879  0.000000  0.000000
1 -0.434911  0.000000  0.000000
2 -0.245262  0.000000  0.887664
3 -0.163723  0.000000  1.476460
4  1.705341 -1.737614 -0.114075
5 -0.444799 -0.019655 -0.514444
6 -0.304669 -1.897173  0.963890

通过一个字典调用fillna，就可以实现对不同的列填充不同的值

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.141879  0.500000  0.000000
1 -0.434911  0.500000  0.000000
2 -0.245262  0.500000  0.887664
3 -0.163723  0.500000  1.476460
4  1.705341 -1.737614 -0.114075
5 -0.444799 -0.019655 -0.514444
6 -0.304669 -1.897173  0.963890

In [25]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                   'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [40]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

keep = 'last'表示从后面开始数，并保留后面不重复行的集合

In [44]:
data.duplicated(['k1','k2'], keep='last')

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [45]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
transform = lambda x: x[:4].upper()

In [53]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [59]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [60]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010151     0.009492    -0.031770     0.036846
std       0.990270     1.033918     1.001722     0.969926
min      -3.157609    -3.352042    -3.522581    -3.024411
25%      -0.670894    -0.691865    -0.727782    -0.594700
50%       0.045057     0.001981    -0.085061     0.016487
75%       0.703818     0.702050     0.585552     0.689872
max       2.921345     3.292568     2.947223     3.126878

In [67]:
col = data[2]

In [68]:
col[np.abs(col) > 3]

36    -3.522581
561   -3.226026
Name: 2, dtype: float64

In [69]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
36  -1.720187 -0.071064 -3.522581 -0.842043
147 -1.098353  3.034326  0.615695  1.534311
204 -0.636779  3.017022 -0.463397  0.971966
293 -0.243293 -1.856337  1.052926  3.125067
412  0.722580  0.168163  1.025407 -3.024411
561  0.051145 -0.164711 -3.226026  0.030023
671 -3.157609 -0.245877 -0.507658  0.438357
768 -0.335216  3.292568  0.884650 -1.112233
922  0.133755 -3.352042  0.613621 -1.389923
968  1.041562 -0.198380 -1.291529  3.126878

根据数据的值是正还是负，np.sign(data)可以生成1和-1

In [70]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作（permuting，随机重 排序）。通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组

In [71]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [73]:
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 2, 0])

In [74]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [75]:
val = 'a,b, guido'

In [76]:
val.split(',')

['a', 'b', ' guido']

In [77]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

replace用于将指定模式替换为另一个模式。通过传入空字符串，它也常常用于删除模式

In [78]:
val.replace(',', '::')

'a::b:: guido'

In [ ]:
import re
text = "foo bar\t baz \tqux"